Revit 2027 API
BuiltInFailures.RegenFailures.RegeneratedElements Property
 Elements regenerated in pass [Regen Index]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RegeneratedElements { get; }
Public Shared ReadOnly Property RegeneratedElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RegeneratedElements {
	FailureDefinitionId^ get ();
}
static member RegeneratedElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace